## pandas
If you cannot remember them all, try to google "pandas cheat sheet" and print it out!

In [1]:
#from pandas import Series, DataFrame
import pandas as pd

### Series

In [2]:
# Series
"""
A Series is a one-dimensional array-like object
containing an array of data (of any NumPy data type) and
an associated array of data labels, called its index.
"""

ser = pd.Series([1, 3, 5, 7])
print(type(ser))
print(ser)

<class 'pandas.core.series.Series'>
0    1
1    3
2    5
3    7
dtype: int64

In [3]:
print(ser.values)
print(ser.index)

[1 3 5 7]
RangeIndex(start=0, stop=4, step=1)

In [4]:
ser2 = pd.Series([1, 3, 5, 7], index = ['d', 'b', 'c', 'a'])
print(ser2)

d    1
b    3
c    5
a    7
dtype: int64

In [5]:
print(ser2['a'])
select = ['a', 'b', 'd']
print(ser2[select]) # shadow

7
a    7
b    3
d    1
dtype: int64

In [6]:
print(ser2[ser2 > 4])

c    5
a    7
dtype: int64

In [7]:
print(ser2 * 2)

d     2
b     6
c    10
a    14
dtype: int64

In [8]:
import numpy as np
print(np.exp(ser2))

d       2.718282
b      20.085537
c     148.413159
a    1096.633158
dtype: float64

In [9]:
print('b' in ser2) # in index, not value!!!

True

In [10]:
# From Python built-in dictionary to (labled) Series
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
ser3 = pd.Series(sdata)
print(ser3)

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [11]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
ser4 = pd.Series(sdata, index = states)
print(ser4)

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [12]:
pd.isnull(ser4) # or ser4.isnull() and try ser4.notnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [13]:
print(ser3)
print(ser4)
print(ser3 + ser4)

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64
California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [14]:
# Name, you can name (the data of) a Series and name its index
ser4.name = "population"
ser4.index.name = "states"
print(ser4)

states
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

### DataFrame

In [15]:
# DataFrame
"""
A DataFrame represents a tabular, spreadsheet-like data structure
containing an ordered collection of columns.
The DataFrame has both a row and column index;
it can be thought of as a dict of Series.

Row-oriented and column-oriented operations in DataFrame
are treated roughly symmetrically.
Under the hood, the data is stored as one or more two-dimensional blocks
rather than a list, dict.
"""

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [16]:
df = pd.DataFrame(data, columns=['year', 'state', 'pop']) # sorted by columns
print(df)

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [17]:
df2 = pd.DataFrame(data,
                   columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
print(df2)

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [18]:
print(df2.year) # or df2['year']
print(df2['state']) # or df2.state

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64
one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [19]:
print(df2.ix['two'])

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object

In [20]:
df2.debt = 5. # try np.arange(5.)
print(df2)

       year   state  pop  debt
one    2000    Ohio  1.5   5.0
two    2001    Ohio  1.7   5.0
three  2002    Ohio  3.6   5.0
four   2001  Nevada  2.4   5.0
five   2002  Nevada  2.9   5.0

In [21]:
ser = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
df2['debt'] = ser
print(df2)

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [22]:
# dictionary-like
df2['eastern'] = (df2.state == 'Ohio')
print(df2)

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [23]:
df3 = df2.T
print(df3)

          one   two three    four    five
year     2000  2001  2002    2001    2002
state    Ohio  Ohio  Ohio  Nevada  Nevada
pop       1.5   1.7   3.6     2.4     2.9
debt      NaN  -1.2   NaN    -1.5    -1.7
eastern  True  True  True   False   False

In [24]:
# Index objects are immutable
print(df2.index)
df2.index[0] = "oneone"

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

TypeError: Index does not support mutable operations

### Reindexing

In [25]:
ser1 = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
ser2 = ser1.reindex(['a', 'b', 'c', 'd', 'e'])
print(ser2)

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [26]:
ser1.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [27]:
# For ordered data like time series, 
# it may be desirable to do some interpolation or
# filling of values when reindexing.

ser3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
ser4 = ser3.reindex(range(6), method='ffill') # ffill: fill (or carry) values forward; bfill: backward
print(ser3)
print(ser4)

0      blue
2    purple
4    yellow
dtype: object
0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [28]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
print(data)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [29]:
d = data.drop(['Colorado', 'Ohio']) # view
d

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [30]:
d = data.drop(['two', 'four'], axis = 1) # view
d

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [31]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [32]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [33]:
data.ix['Colorado', ['two', 'three']] # DataFrame has no data[vala, valb], please use 'ix[]'

two      5
three    6
Name: Colorado, dtype: int32

In [34]:
# +-*/ still work for DataFrame

In [35]:
frame = pd.DataFrame(np.random.randn(4, 3),
                     index = ['Utah', 'Ohio', 'Texas', 'Oregon'],
                     columns = list('abd'))
print(frame)

               a         b         d
Utah    0.424176  1.404561 -0.598514
Ohio   -0.127224 -0.918966 -1.656195
Texas  -1.448302 -0.797252 -0.250485
Oregon -1.549883 -0.642926  0.920256

In [36]:
f = lambda x: x.max() - x.min() # x should be a list-like data
frame.apply(f, axis = 0)

a    1.974058
b    2.323527
d    2.576452
dtype: float64

In [37]:
help(pd.DataFrame.apply) # see pd.DataFrame.apply and pd.DataFrame.applymap

Help on function apply in module pandas.core.frame:

apply(self, func, axis=0, broadcast=False, raw=False, reduce=None, args=(), **kwds)
    Applies function along input axis of DataFrame.

    Objects passed to functions are Series objects having index
    either the DataFrame's index (axis=0) or the columns (axis=1).
    Return type depends on whether passed function aggregates, or the
    reduce argument if the DataFrame is empty.

    Parameters
    ----------
    func : function
        Function to apply to each column/row
    axis : {0 or 'index', 1 or 'columns'}, default 0
        * 0 or 'index': apply function to each column
        * 1 or 'columns': apply function to each row
    broadcast : boolean, default False
        For aggregation functions, return object of same size with values
        propagated
    raw : boolean, default False
        If False, convert each row or column into a Series. If raw=True the
        passed function will receive ndarray objects instead. If you are
        just applying a NumPy reduction function this will achieve much
        better performance
    reduce : boolean or None, default None
        Try to apply reduction procedures. If the DataFrame is empty,
        apply will use reduce to determine whether the result should be a
        Series or a DataFrame. If reduce is None (the default), apply's
        return value will be guessed by calling func an empty Series (note:
        while guessing, exceptions raised by func will be ignored). If
        reduce is True a Series will always be returned, and if False a
        DataFrame will always be returned.
    args : tuple
        Positional arguments to pass to function in addition to the
        array/series
    Additional keyword arguments will be passed as keywords to the function

    Notes
    -----
    In the current implementation apply calls func twice on the
    first column/row to decide whether it can take a fast or slow
    code path. This can lead to unexpected behavior if func has
    side-effects, as they will take effect twice for the first
    column/row.

    Examples
    --------
    >>> df.apply(numpy.sqrt) # returns DataFrame
    >>> df.apply(numpy.sum, axis=0) # equiv to df.sum(0)
    >>> df.apply(numpy.sum, axis=1) # equiv to df.sum(1)

    See also
    --------
    DataFrame.applymap: For elementwise operations

    Returns
    -------
    applied : Series or DataFrame

In [38]:
frame = pd.DataFrame(np.random.randn(4, 3),
                     index = ['Utah', 'Ohio', 'Texas', 'Oregon'],
                     columns = list('cda'))
frame.sort_index()

               c         d         a
Ohio   -0.261565 -0.131273 -1.116740
Oregon -2.854009 -1.411692 -0.667789
Texas  -0.047906  0.556296  1.376646
Utah    2.002202  1.300547  1.109897

In [39]:
frame.sort_index(axis=1)

               a         c         d
Utah    1.109897  2.002202  1.300547
Ohio   -1.116740 -0.261565 -0.131273
Texas   1.376646 -0.047906  0.556296
Oregon -0.667789 -2.854009 -1.411692

In [40]:
frame.sort_index(axis=1, ascending=False)

               d         c         a
Utah    1.300547  2.002202  1.109897
Ohio   -0.131273 -0.261565 -1.116740
Texas   0.556296 -0.047906  1.376646
Oregon -1.411692 -2.854009 -0.667789

### Summarizing and Computing Descriptive Statistics

In [41]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])

print(df)

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [42]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [43]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [44]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [45]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [46]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [47]:
# On non-numeric data,
# describe() produces alternate summary statistics
s = pd.Series(['a', 'a', 'b', 'c'] * 4)
s.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Yahoo! Finance

You definitely want to check it out.
https://pandas-datareader.readthedocs.io/en/latest/

In [48]:
import pandas_datareader.data as web #  pip install pandas-datareader
import datetime

In [49]:
start = datetime.datetime(2010, 1, 1)
end = datetime.datetime(2013, 1, 27)
f = web.DataReader("F", 'yahoo', start, end)

In [50]:
print(type(f)) # like in heaven
print(f.head())
print(f.ix['2010-01-04'])

<class 'pandas.core.frame.DataFrame'>
             Open   High    Low  Close     Volume  Adj Close
Date
2010-01-04  10.17  10.28  10.05  10.28   60855800   8.418735
2010-01-05  10.45  11.24  10.40  10.96  215620200   8.975616
2010-01-06  11.21  11.46  11.13  11.37  200070600   9.311383
2010-01-07  11.46  11.69  11.32  11.66  130201700   9.548876
2010-01-08  11.67  11.74  11.46  11.69  130463000   9.573444
Open         1.017000e+01
High         1.028000e+01
Low          1.005000e+01
Close        1.028000e+01
Volume       6.085580e+07
Adj Close    8.418735e+00
Name: 2010-01-04 00:00:00, dtype: float64

### Correlation and Covariance

In [51]:
# I want to know the replationship between several companies, ['AAPL', 'IBM', 'MSFT', 'GOOG'].
companies = ['AAPL', 'IBM', 'MSFT', 'GOOG']

# I need a 2D table, so using DataFrame and dictionary might be a good idea.
# {'AAPL': [value1, v2, v3, ...], 'IBM': [v1, v2, v3, ...], ...}
stock_data_dict = dict()

In [52]:
# Take a look at the API, help(web) or help(pandas_datareader.data)

# collect all data first
for com in companies:
    stock_data_dict[com] = web.get_data_yahoo(com, start, end)

for key in stock_data_dict:
    print(key, type(stock_data_dict[key]))

AAPL <class 'pandas.core.frame.DataFrame'>
IBM <class 'pandas.core.frame.DataFrame'>
MSFT <class 'pandas.core.frame.DataFrame'>
GOOG <class 'pandas.core.frame.DataFrame'>

In [53]:
# Two DataFrames. Select interesting columns, i.e., 'Volume' and 'Adj Close'.
adjClose = pd.DataFrame({key: stock_data_dict[key]['Adj Close']
                         for key in stock_data_dict})
volume = pd.DataFrame({key: stock_data_dict[key]['Volume']
                       for key in stock_data_dict})

In [54]:
print(adjClose.head())

                 AAPL        GOOG         IBM       MSFT
Date
2010-01-04  27.727039  313.062468  111.405000  25.555485
2010-01-05  27.774976  311.683844  110.059232  25.563741
2010-01-06  27.333178  303.826685  109.344283  25.406859
2010-01-07  27.282650  296.753749  108.965786  25.142634
2010-01-08  27.464034  300.709808  110.059232  25.316031

In [55]:
print(volume.head())

                 AAPL      GOOG      IBM      MSFT
Date
2010-01-04  123432400   3927000  6155300  38409100
2010-01-05  150476200   6031900  6841400  49749600
2010-01-06  138040000   7987100  5605300  58182400
2010-01-07  119282800  12876600  5840600  50559700
2010-01-08  111902700   9483900  4197200  51197400

In [56]:
"""
Series.pct_change(periods=1, fill_method='pad', limit=None, freq=None)
Percent change over given number of periods.
"""

ptcAdjClose = adjClose.pct_change()
ptcAdjClose.tail()

                AAPL      GOOG       IBM      MSFT
Date
2013-01-18 -0.005331 -0.009574  0.004234  0.000000
2013-01-22  0.009540 -0.002328  0.008279 -0.003670
2013-01-23  0.018305  0.054960  0.044064  0.016943
2013-01-24 -0.123558  0.017141 -0.001465  0.000724
2013-01-25 -0.023574 -0.000716  0.002691  0.009048

In [57]:
# Find the relation between IBM and MSFT
# Do they have 'similar' ptc?

print(ptcAdjClose.AAPL.corr(ptcAdjClose.IBM))
print(pd.Series.corr(ptcAdjClose.AAPL, ptcAdjClose.IBM))

0.48624902285
0.48624902285

In [58]:
print(ptcAdjClose.AAPL.cov(ptcAdjClose.IBM))

0.000104594383324

In [59]:
# DataFrame's version returns all
ptcAdjClose.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.498942  0.486249  0.449461
GOOG  0.498942  1.000000  0.477658  0.470474
IBM   0.486249  0.477658  1.000000  0.646422
MSFT  0.449461  0.470474  0.646422  1.000000

In [60]:
ptcAdjClose.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000324  0.000152  0.000105  0.000112
GOOG  0.000152  0.000287  0.000097  0.000111
IBM   0.000105  0.000097  0.000143  0.000107
MSFT  0.000112  0.000111  0.000107  0.000192

In [61]:
ptcAdjClose.corrwith(ptcAdjClose.IBM) # another way

AAPL    0.486249
GOOG    0.477658
IBM     1.000000
MSFT    0.646422
dtype: float64

In [62]:
# Passing a DataFrame computes the correlations of matching column names.
ptcAdjClose.corrwith(volume)

AAPL   -0.149283
GOOG   -0.095221
IBM    -0.095812
MSFT   -0.130049
dtype: float64

### Count Data

In [63]:
df = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                'Qu2': [2, 3, 1, 2, 3],
                'Qu3': [1, 5, 2, 4, 4]})
print(df)

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [64]:
# I want to know how many 1s, 2s, ... in each column.
rdf = df.apply(pd.value_counts)
#rdf = rdf.fillna(0)
print(rdf)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

### Handling Missing Data

In [65]:
from numpy import nan as NaN

s_data = pd.Series(['aardvark', 'artichoke', NaN, 'avocado'])
s_data.isnull() # notnull()

0    False
1    False
2     True
3    False
dtype: bool

In [66]:
print(s_data.dropna())

0     aardvark
1    artichoke
3      avocado
dtype: object

In [67]:
print(s_data.fillna('N/A'))

0     aardvark
1    artichoke
2          N/A
3      avocado
dtype: object

In [68]:
# DataFrame version has reachful args.

import numpy.random
s = pd.Series(numpy.random.randn(21))
s[s < 0] = NaN
s = s.values.reshape(7,3)
df = pd.DataFrame(s)
print(df)

          0         1         2
0       NaN       NaN  1.266095
1  0.211849       NaN       NaN
2       NaN       NaN       NaN
3       NaN  1.782417  0.193499
4  0.156458  0.628250  0.056704
5  0.143394       NaN       NaN
6  1.188171  0.376343  1.572968

In [69]:
df = pd.DataFrame(numpy.random.randn(7,3))
df = df.apply(lambda s: [i if i > 0 else NaN for i in s])
df

          0         1         2
0  0.555403  0.963791       NaN
1  0.387114       NaN  0.218096
2       NaN  1.161369       NaN
3       NaN       NaN       NaN
4  1.793061       NaN       NaN
5       NaN       NaN       NaN
6  1.747801       NaN  1.575671

In [70]:
df.fillna({0: -0.5, 1: -1}) # try fillna(0, inplace=True)

          0         1         2
0  0.555403  0.963791       NaN
1  0.387114 -1.000000  0.218096
2 -0.500000  1.161369       NaN
3 -0.500000 -1.000000       NaN
4  1.793061 -1.000000       NaN
5 -0.500000 -1.000000       NaN
6  1.747801 -1.000000  1.575671

In [71]:
df.fillna(method='ffill') # method : {'backfill', 'bfill', 'pad', 'ffill', None}

          0         1         2
0  0.555403  0.963791       NaN
1  0.387114  0.963791  0.218096
2  0.387114  1.161369  0.218096
3  0.387114  1.161369  0.218096
4  1.793061  1.161369  0.218096
5  1.793061  1.161369  0.218096
6  1.747801  1.161369  1.575671

In [72]:
print(df.mean())
print(df.fillna(df.mean()))

0    1.120845
1    1.062580
2    0.896883
dtype: float64
          0         1         2
0  0.555403  0.963791  0.896883
1  0.387114  1.062580  0.218096
2  1.120845  1.161369  0.896883
3  1.120845  1.062580  0.896883
4  1.793061  1.062580  0.896883
5  1.120845  1.062580  0.896883
6  1.747801  1.062580  1.575671

### High Dimensional Indexing, Hierarchical Indexing

In [73]:
import numpy.random

data = pd.Series(numpy.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
print(data)
print(data.index)

a  1   -0.439407
   2    1.499745
   3    0.596770
b  1    0.046775
   2    0.608353
   3   -1.295315
c  1    1.709675
   2   -0.003834
d  2    0.251588
   3    1.740886
dtype: float64
MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [74]:
data['b'] # Note that data is a Series

1    0.046775
2    0.608353
3   -1.295315
dtype: float64

In [75]:
data['b':'c']

b  1    0.046775
   2    0.608353
   3   -1.295315
c  1    1.709675
   2   -0.003834
dtype: float64

In [76]:
data[:, 2] # there is a ','

a    1.499745
b    0.608353
c   -0.003834
d    0.251588
dtype: float64

In [77]:
# Since Series is conceptually 1D,
# we can unstack() it to DataFrame
# Question: what is the differenc bewteen multi-indexed 1D data and 2D data?

data.unstack()

          1         2         3
a -0.439407  1.499745  0.596770
b  0.046775  0.608353 -1.295315
c  1.709675 -0.003834       NaN
d       NaN  0.251588  1.740886

In [78]:
data.unstack().stack() # NaN will be ignored.

a  1   -0.439407
   2    1.499745
   3    0.596770
b  1    0.046775
   2    0.608353
   3   -1.295315
c  1    1.709675
   2   -0.003834
d  2    0.251588
   3    1.740886
dtype: float64

In [79]:
import numpy

frame = pd.DataFrame(numpy.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [80]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [81]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [82]:
frame.sortlevel(1) # start from 0, try 1

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [83]:
"""
Note: usually, you swaplevel(1).sortlevel(1).
Data selection performance is much better on hierarchically indexed objects
if the index is lexicographically sorted starting with the outermost level.
"""

'\nNote: usually, you swaplevel(1).sortlevel(1).\nData selection performance is much better on hierarchically indexed objects\nif the index is lexicographically sorted starting with the outermost level.\n'

In [84]:
frame.sum()

state     color
Ohio      Green    18
          Red      22
Colorado  Green    26
dtype: int64

In [85]:
frame.sum(level='key2') # keep the level structure of 'key2'

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [86]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Move column to index

In [87]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [88]:
frame.set_index(['c','d'], drop=True) # Try drop=False

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [89]:
frame.reset_index() # move the hierarchical index levels to column

   index  a  b    c  d
0      0  0  7  one  0
1      1  1  6  one  1
2      2  2  5  one  2
3      3  3  4  two  0
4      4  4  3  two  1
5      5  5  2  two  2
6      6  6  1  two  3

### pandas's Panel Data
Question: do we truly need N-dimensional arrays?
Panel is 3d.

In [90]:
import pandas_datareader.data as web
import datetime

companies = ['AAPL', 'IBM', 'MSFT', 'GOOG']
start = datetime.datetime(2010, 1, 1)
end = datetime.datetime(2013, 1, 27)

In [91]:
stock_data_dict = dict()
for com in companies:
    stock_data_dict[com] = web.get_data_yahoo(com, start, end)

In [92]:
pdata = pd.Panel(
    dict(
        (stk, web.get_data_yahoo(stk, start, end)) for stk in companies
    )
)

In [93]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 771 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2013-01-25 00:00:00
Minor_axis axis: Open to Adj Close

In [94]:
pdata.ix[:, '6/1/2012', :]

                   AAPL          GOOG           IBM          MSFT
Open       5.691600e+02  5.717910e+02  1.901200e+02  2.876000e+01
High       5.726500e+02  5.726510e+02  1.917200e+02  2.896000e+01
Low        5.605200e+02  5.683510e+02  1.886000e+02  2.844000e+01
Close      5.609900e+02  5.709810e+02  1.890800e+02  2.845000e+01
Volume     1.302469e+08  6.138700e+06  5.206400e+06  5.663430e+07
Adj Close  7.268161e+01  2.852053e+02  1.661560e+02  2.494224e+01

In [95]:
pdata.ix[:, '5/22/2012':, 'Adj Close'].head()

                 AAPL        GOOG         IBM       MSFT
Date
2012-05-22  72.160786  300.100412  172.957593  26.090721
2012-05-23  73.921494  304.426106  172.342450  25.520864
2012-05-24  73.242607  301.528978  172.316088  25.485795
2012-05-25  72.850038  295.470050  170.743113  25.477028
2012-05-29  74.143041  296.873645  172.641238  25.915380